def move(num, shifts):
    num_str = str(num)
    shifts = shifts % len(num_str)  # למקרה שמספר ההזזות גדול מהאורך
    moved = num_str[-shifts:] + num_str[:-shifts]
    return [int(ch) for ch in moved]  # המרה ל-int

# #כתבו פונקציה אשר מקבלת שני מספרים, המספר השני יסמן את מספר הזזות ימינה שיש לבצע במספר הראשון, ולאחר מכן מחזירה את התוצאה כרשימה.
# הריצו את הפונקציה שהרצתם כאשר המספר הראשון הינו ת.ז. שלכם, לדוגמא:
# move(12345,1)--> 51234
# move(12345,2)--> 45123
# move(12345,3)--> 34512
# move(12345,4)--> 23451