import  numpy as np
#מערך חד מימדי
array1d=np.array([2,3,8])
#מערך דו מימדי
array2d=np.array([[2,3,8],
                  [4,5,6]])


#חיתוך מערכים חד מימדי
print(array1d[1])
print(array1d[1:])# מדפיס מהאיבר השני עד סוף השורה
print('********************************************')
#חיתוך מערכים דו מימדי

print(array2d[1])#הדפסת שורה ראשונה
print(array2d[1:])#עוד דרך להדפסת שורה ראשונה

print(array2d[1][2]) #תדפיס שורה שניה עמודה שלישית
print(array2d[1,2])# קיצור לאותה פקודה

print(array2d[:,0])# הדפסת כל העמודה הראשונה






